# yosys -m wildebeest -s mae-techmap-efpga_mult_rego_unsigned.ys
read_verilog <<EOF
module efpga_mult_rego_unsigned_map_inst
  # (
     parameter INPUT_WIDTH = 17,
     parameter OUTPUT_WIDTH = 34
     )
   (
    input                                   clk,
    input                                   resetn,
    input [(INPUT_WIDTH-1):0]               a,
    input [(INPUT_WIDTH-1):0]               b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   always @(posedge clk or negedge resetn) begin
      if (~resetn) begin
         y <= 'h0;
      end
      else begin
         y <= a * b;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult_rego
select -assert-count 1 */t:efpga_mult_rego %x:+[clk] */w:clk %i
select -assert-count 1 */t:efpga_mult_rego %x:+[resetn] */w:resetn %i
