# yosys -m wildebeest -s mae-techmap-efpga_macc_regi_unsigned.ys
read_verilog <<EOF
module efpga_macc_regi_unsigned_map_inst
  # (
     parameter INPUT_WIDTH = 17,
     parameter OUTPUT_WIDTH = 40
     )
   (
    input                                   clk,
    input                                   resetn,
    input [(INPUT_WIDTH-1):0]               a,
    input [(INPUT_WIDTH-1):0]               b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   wire [(2*INPUT_WIDTH-1):0] product;

   reg [(INPUT_WIDTH-1):0] a_reg;
   reg [(INPUT_WIDTH-1):0] b_reg;

   always @(posedge clk or negedge resetn) begin
      if (~resetn) begin
         a_reg <= 'h0;
         b_reg <= 'h0;
      end
      else begin
         a_reg <= a;
         b_reg <= b;
      end
   end

   assign product = a_reg * b_reg;

   always @(posedge clk or negedge resetn) begin
      if (~resetn) begin
         y <= 'h0;
      end
      else begin
         y <= y + product;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_macc_regi
