# yosys -m wildebeest -s mae-techmap-efpga_mult.ys
read_verilog <<EOF
module efpga_mult_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 36
     )
   (
    input signed [(INPUT_WIDTH-1):0]   a,
    input signed [(INPUT_WIDTH-1):0]   b,
    output [(OUTPUT_WIDTH-1):0]        y
    );

   assign y = a * b;

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult
