# yosys -m wildebeest -s mae-techmap-efpga_mult_unsigned.ys
read_verilog <<EOF
module efpga_mult_unsigned_map_inst
  # (
     parameter INPUT_WIDTH = 17,
     parameter OUTPUT_WIDTH = 34
     )
   (
    input [(INPUT_WIDTH-1):0]   a,
    input [(INPUT_WIDTH-1):0]   b,
    output [(OUTPUT_WIDTH-1):0] y
    );

   assign y = a * b;

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult
select -assert-count 0 */t:efpga_mult %x:+[clk] */w:clk %i
select -assert-count 0 */t:efpga_mult %x:+[resetn] */w:resetn %i
