# yosys -m wildebeest -s mae-techmap-efpga_macc.ys
read_verilog <<EOF
module efpga_macc_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40
     )
   (
    input                                   clk,
    input                                   resetn,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   wire signed [(2*INPUT_WIDTH-1):0] product;

   assign product = a * b;

   always @(posedge clk or negedge resetn) begin
      if (~resetn) begin
         y <= 'h0;
      end
      else begin
         y <= y + product;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_macc
select -assert-count 1 */t:efpga_macc %x:+[clk] */w:clk %i
select -assert-count 1 */t:efpga_macc %x:+[resetn] */w:resetn %i
