# yosys -m wildebeest -s mae-techmap-efpga_mult_addc_regio.ys
read_verilog <<EOF
module efpga_mult_addc_regio_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40,
     localparam C_WIDTH = OUTPUT_WIDTH
     )
   (
    input                                   clk,
    input                                   resetn,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    input signed [(C_WIDTH-1):0]            c,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   reg signed [(INPUT_WIDTH-1):0] a_reg;
   reg signed [(INPUT_WIDTH-1):0] b_reg;
   reg signed [(C_WIDTH-1):0]     c_reg;

   always @(posedge clk or negedge resetn) begin
      if (~resetn) begin
         a_reg <= 'h0;
         b_reg <= 'h0;
         c_reg <= 'h0;
      end
      else begin
         a_reg <= a;
         b_reg <= b;
         c_reg <= c;
      end
   end

   always @(posedge clk or negedge resetn) begin
      if (~resetn) begin
         y <= 'h0;
      end
      else begin
         y <= (a_reg * b_reg) + c_reg;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult_addc_regio
select -assert-count 1 */t:efpga_mult_addc_regio %x:+[clk] */w:clk %i
select -assert-count 1 */t:efpga_mult_addc_regio %x:+[resetn] */w:resetn %i
