# yosys -m wildebeest -s mae-techmap-sync-efpga_mult_regio.ys
# Synchronous reset: $sdff not absorbed, all registers stay outside DSP
read_verilog <<EOF
module efpga_mult_regio_sync_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 36
     )
   (
    input                                   clk,
    input                                   reset,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   reg signed [(INPUT_WIDTH-1):0] a_reg;
   reg signed [(INPUT_WIDTH-1):0] b_reg;

   always @(posedge clk) begin
      if (reset) begin
         a_reg <= 'h0;
         b_reg <= 'h0;
      end
      else begin
         a_reg <= a;
         b_reg <= b;
      end
   end

   always @(posedge clk) begin
      if (reset) begin
         y <= 'h0;
      end
      else begin
         y <= a_reg * b_reg;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult
select -assert-count 0 */t:efpga_mult_regio
select -assert-count 0 */t:efpga_mult %x:+[clk] */w:clk %i
