# yosys -m wildebeest -s mae-techmap-sync-efpga_mult_rego.ys
# Synchronous reset: $sdff not absorbed, output register stays outside DSP
read_verilog <<EOF
module efpga_mult_rego_sync_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 36
     )
   (
    input                                   clk,
    input                                   reset,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   always @(posedge clk) begin
      if (reset) begin
         y <= 'h0;
      end
      else begin
         y <= a * b;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult
select -assert-count 0 */t:efpga_mult_rego
select -assert-count 0 */t:efpga_mult %x:+[clk] */w:clk %i
select -assert-count 0 */t:efpga_mult %x:+[resetn] */w:reset %i
