# yosys -m wildebeest -s mae-techmap-sync-efpga_macc_pipe.ys
# Synchronous reset: pipeline register ($sdff) blocks postAddMatching since
# the $add is no longer directly on sigP; no packing occurs, degrades to efpga_mult
read_verilog <<EOF
module efpga_macc_pipe_sync_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40
     )
   (
    input                                   clk,
    input                                   reset,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   reg signed [(2*INPUT_WIDTH-1):0] product;

   always @(posedge clk) begin
      if (reset) begin
         product <= 'h0;
      end
      else begin
         product <= a * b;
      end
   end

   always @(posedge clk) begin
      if (reset) begin
         y <= 'h0;
      end
      else begin
         y <= y + product;
      end
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult
select -assert-count 0 */t:efpga_macc_pipe
select -assert-count 0 */t:efpga_mult %x:+[clk] */w:clk %i
