# yosys -m wildebeest -s mae-techmap-norst-efpga_mult_addc_regi.ys
# Plain $dff (no reset): input registers absorbed, clk connected, resetn tied 1'b1
read_verilog <<EOF
module efpga_mult_addc_regi_norst_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40,
     localparam C_WIDTH = OUTPUT_WIDTH
     )
   (
    input                                   clk,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    input [(C_WIDTH-1):0]                   c,
    output [(OUTPUT_WIDTH-1):0]             y
    );

   reg signed [(INPUT_WIDTH-1):0] a_reg;
   reg signed [(INPUT_WIDTH-1):0] b_reg;
   reg [39:0]                     c_reg;

   always @(posedge clk) begin
      a_reg <= a;
      b_reg <= b;
      c_reg <= c;
   end

   assign y = (a_reg * b_reg) + c_reg;

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult_addc_regi
select -assert-count 1 */t:efpga_mult_addc_regi %x:+[clk] */w:clk %i
select -assert-count 0 */t:efpga_mult_addc_regi %x:+[resetn] */w:resetn %i
