# yosys -m wildebeest -s mae-techmap-norst-efpga_macc.ys
# Plain $dff (no reset): accumulate register absorbed, clk connected, resetn tied 1'b1
read_verilog <<EOF
module efpga_macc_norst_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40
     )
   (
    input                                   clk,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   wire signed [(2*INPUT_WIDTH-1):0] product;

   assign product = a * b;

   always @(posedge clk) begin
      y <= y + product;
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_macc
select -assert-count 1 */t:efpga_macc %x:+[clk] */w:clk %i
select -assert-count 0 */t:efpga_macc %x:+[resetn] */w:resetn %i
