# yosys -m wildebeest -s mae-techmap-norst-efpga_macc_pipe_regi.ys
# Plain $dff (no reset): all registers absorbed, clk connected, resetn tied 1'b1
read_verilog <<EOF
module efpga_macc_pipe_regi_norst_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40
     )
   (
    input                                   clk,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   reg signed [(2*INPUT_WIDTH-1):0] product;

   reg signed [(INPUT_WIDTH-1):0] a_reg;
   reg signed [(INPUT_WIDTH-1):0] b_reg;

   always @(posedge clk) begin
      a_reg <= a;
      b_reg <= b;
   end

   always @(posedge clk) begin
      product <= a_reg * b_reg;
   end

   always @(posedge clk) begin
      y <= y + product;
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_macc_pipe_regi
select -assert-count 1 */t:efpga_macc_pipe_regi %x:+[clk] */w:clk %i
select -assert-count 0 */t:efpga_macc_pipe_regi %x:+[resetn] */w:resetn %i
