# yosys -m wildebeest -s mae-techmap-norst-efpga_mult_addc_rego.ys
# Plain $dff (no reset): output register absorbed, clk connected, resetn tied 1'b1
read_verilog <<EOF
module efpga_mult_addc_rego_norst_map_inst
  # (
     parameter INPUT_WIDTH = 18,
     parameter OUTPUT_WIDTH = 40,
     localparam C_WIDTH = OUTPUT_WIDTH
     )
   (
    input                                   clk,
    input signed [(INPUT_WIDTH-1):0]        a,
    input signed [(INPUT_WIDTH-1):0]        b,
    input signed [(C_WIDTH-1):0]            c,
    output reg [(OUTPUT_WIDTH-1):0]         y
    );

   always @(posedge clk) begin
      y <= (a * b) + c;
   end

endmodule
EOF

synth_fpga -partname z1010
select -assert-count 1 */t:efpga_mult_addc_rego
select -assert-count 1 */t:efpga_mult_addc_rego %x:+[clk] */w:clk %i
select -assert-count 0 */t:efpga_mult_addc_rego %x:+[resetn] */w:resetn %i
